[
  {
    "title": "React.js. Быстрый старт",
    "cover": "https://ozon-st.cdn.ngenix.net/multimedia/1019496005.jpg",
    "description": "Незаменимая вводная книга по технологии React для взыскательных JavaScript-разработчиков. Все самое интересное о сверхпопулярном инструменте от компании Facebook. В книге рассмотрены основные концепции высокопроизводительного программирования при помощи React, реальные примеры кода и доступные блок-схемы.",
    "author": "Стоян Стефанов",
    "codeISBN": "139961087",
    "published": "2017",
    "rating": "4",
    "topic": "react"
  },
  {
    "title": "JavaScript. Сильные стороны",
    "cover": "",
    "description": "Любой язык программирования имеет свои сильные и слабые стороны, однако язык JavaScript в большей степени состоит из последних, так как был разработан в спешке и практически не отлаживался. В этой книге среди множества самых ужасных JavaScript-конструкций выделены наиболее надежные, понятные и удобные в сопровождении то подмножество языка, которое позволяет создавать по-настоящему расширяемый и эффективный код. Автор - уважаемый среди разработчиков эксперт в области JavaScript выделяет массу интересных идей, которые делают JavaScript прекрасным объектно-ориентированным языком программирования. Эта книга откроет вам красивый, элегантный, простой и выразительный язык программирования, позволяющий создавать эффективный код независимо от того, управляете вы библиотеками объектов или просто пытаетесь заставить Ajax работать быстрее. Если вы разрабатываете сайты или приложения для Интернета, via книга вам просто необходима.",
    "author": "Дуглас Крокфорд",
    "codeISBN": "20217226",
    "published": "2013",
    "rating": "4.5",
    "topic": "javascript"
  },
  {
    "title": "JavaScript. Оптимизация производительности",
    "cover": "https://ozon-st.cdn.ngenix.net/multimedia/1005511392.jpg",
    "description": "Если вы относитесь к подавляющему большинству веб-разработчиков, то наверняка широко применяете JavaScript для создания интерактивных веб-приложений с малым временем отклика. Проблема состоит в том, что строки с программным кодом на языке JavaScript могут замедлять работу приложений. Эта книга откроет вам приемы и стратегии, которые помогут в ходе разработки устранить узкие места, влекущие за собой снижение производительности. Вы узнаете, как ускорить выполнение, загрузку, операции с деревом DOM, работу страницы в целом и многое другое. Николас Закас, программист из компании Yahoo!, специализирующийся на разработке пользовательских интерфейсов веб-приложений, и еще пять экспертов в области использования JavaScript представят оптимальные способы загрузки сценариев и другие приемы программирования, которые помогут вам обеспечить наиболее эффективное и быстрое выполнение программного кода на JavaScript. Вы познакомитесь с наиболее передовыми приемами сборки и развертывания файлов в действующем окружении и с инструментами, которые помогут в поиске проблем. Книга адресована веб-разработчикам со средним и высоким уровнем владения языком JavaScript, желающим повысить производительность интерфейсов веб-приложений.",
    "author": "Николас Закас",
    "codeISBN": "18421547",
    "published": "2012",
    "rating": "4.5",
    "topic": "javascript"
  },
  {
    "title": "JavaScript и jQuery. Исчерпывающее руководство",
    "cover": "https://ozon-st.cdn.ngenix.net/multimedia/1016412966.jpg",
    "description": "JavaScript - основной инструмент веб-разработчиков, позволяющий делать интернет-страницы интерактивными. Перед вами - наиболее полное и великолепно структурированное руководство по JavaScript, которое позволит в совершенстве овладеть этим востребованным сейчас языком программирования. В книге уделено большое внимание библиотеке jQuery, в том числе самого современного плагина jQuery UI.\nОт Ozon\nЯзык программирования JavaScript позволяет усовершенствовать ваши веб-страницы с помощью анимации, интерактивных элементов и визуальных эффектов, но его не так просто изучить и освоить. Новое, обновленное и расширенное издание уже ставшей классикой книги доступно объясняет основы языка JavaScript и показывает, как можно экономить время и силы с помощью библиотеки jQuery, содержащей готовые фрагменты кода JavaScript, и новейшего плагина jQuery UI. Прочитав эту книгу вы сможете:\n• Сделать свои страницы интерактивными. Используйте библиотеку jQuery для создания интерактивных элементов, реагирующих на действия посетителя.\n• Освоить новейший плагин jQuery UI. Улучшайте интерфейс, используя панели с вкладками, диалоговые окна, панели для выбора дат и другие виджеты.\n• Создавать удобные формы. Собирайте данные посетителей, помогайте покупателям осуществлять покупки и позволяйте участникам оставлять комментарии.\n• Применять технологию Ajax. Организуйте обмен данными между веб-страницами и веб-сервером без необходимости перезагрузки страниц. \n• Углубить свои знания. Используйте редактор ThemeRoller для настройки виджетов. Избегайте типичных ошибок, свойственных начинающим программистам. \nДэвид МакФарланд — президент компании McFarland Media, около 20 лет занимается созданием сайтов и их управлением. Он преподавал в Калифорнийском университете в Беркли и в Портлендском государственном университете. Дэвид написал более 15 книг компьютерной тематике, в том числе по CSS и JavaScript.",
    "author": "Дэвид Сойер Макфарланд",
    "codeISBN": "33835343",
    "published": "2017",
    "rating": "4.5",
    "topic": "javascript"
  },
  {
    "title": "Изучаем JavaScript. Руководство по созданию современных веб-сайтов",
    "cover": "https://ozon-st.cdn.ngenix.net/multimedia/1019046801.jpg",
    "description": "Сейчас самое время изучить JavaScript. После выхода последней спецификации JavaScript - ECMAScript 6.0 (ES6) - научиться создавать высококачественные приложения на этом языке стало проще, чем когда-либо ранее. Эта книга знакомит программистов (любителей и профессионалов) со спецификацией ES6 наряду с некоторыми связанными с ней инструментальными средствами и методиками на сугубо практической основе.Этан Браун, автор книги Web Development with Node and Express, излагает не только простые и понятные темы (переменные, ветвление потока, массивы), но и более сложные концепции, такие как функциональное и асинхронное программирование. Вы узнаете, как создавать мощные и эффективные веб-приложения для работы на клиенте или сервере Node.js.\n\n- Используйте ES6 для транскомпиляции в переносимый код ESS;\n- Преобразуйте данные в формат, который может использовать JavaScript;\n- Усвойте основы и механику применения функций JavaScript;\n- Изучите объекты и объектно-ориентированное программирование;\n- Ознакомьтесь с новыми концепциями, такими как итераторы, генераторы и прокси-объекты;\n- Преодолейте сложности асинхронного программирования;\n- Используйте объектную модель документа для приложений, выполняемых в браузере;\n- Изучите основы применения платформы Node.js для разработки серверных приложений.;\n\nОб авторе\nЭтан Браун - директор интерактивного маркетингового агентства Engineering at Pop Art, в котором он отвечает за архитектуру и реализацию веб-сайтов и веб-служб для любых клиентов, от малых предприятий до транснациональных компаний.\nЭтан обладает более чем 20-летним стажем программирования.\n\n\"Всем разработчикам действительно пришло время изучить JS. Под изучением я не имею в виду примитивное \"Я получил некий работоспособный код\". Эта книга - куда глубже и обеспечивает именно то изучение, в котором все мы нуждаемся!\"\n- Кайл Симпсон (Kyle Simpson)\nАвтор серии You Don't Know JS\n\n\"Хорошо написанное сжатое введение в JavaScript, включая ECMAScript 6\".\n- Аксель Роушмайер (Axel Rauschmayer)\nАвтор Speaking JavaScript\n\nЭта книга предназначена, прежде всего, для читателей, уже обладающих некоторым опытом программирования (освоивших хотя бы вводный курс программирования). Новичкам в программировании эта книга тоже будет полезна, однако будет не лишним дополнить ее вводным курсом.\nТе, кто уже обладают некоторым опытом программирования в JavaScript (особенно если это только ES5), найдут практически полное описание важнейших концепций этого языка. Программистам, переходящим на JavaScript с другого языка, содержимое этой книги также должно понравиться.\n\nВ этой книге предпринята попытка всесторонне рассмотреть возможности языка, связанные с ним инструментальные средства, методики и парадигмы, которые управляют современной разработкой на JavaScript. Поэтому в данную книгу включены как простой и понятный материал (переменные, ветвление потока, функции), так и довольно сложный (асинхронное программирование, регулярные выражения). В зависимости от своего уровня подготовки, вы можете найти одни главы более сложными, чем другие: начинающий программист, без сомнения, должен будет повторно пройти часть материала.\n\nЭта книга - не полный справочник по JavaScript или связанным с ним библиотекам. Сеть Mozilla Developer Network (MDN) представляет собой превосходный, полный, актуальный и бесплатный сетевой справочник по JavaScript, на который я ссылаюсь повсюду в этой книге.\n\nВы изучаете JavaScript в самый подходящий момент. Веб вышел из младенческого возраста (с технической точки зрения), а веб-разработка, без сомнения, - больше не Дикий Запад, которым она была лет 5-10 назад. Такие стандарты, как HTML5 и ES6, облегчают изучение веб-разработки и упрощают разработку высококачественных приложений. Платформа Node.js делает JavaScript доступным и вне браузера; теперь это вполне подходящий выбор для системных сценариев, разработки приложений рабочего стола, приложений для веб-серверов и даже встраиваемых приложений.\n\nСпецификация ES6 представляет существенное усовершенствование языка JavaScript, и некоторые из главных недостатков спецификации ES5 были устранены в ES6. Я полагаю, что вы найдете язык ES6 намного более приятным и мощным в применении (а ES5 был бы весьма хорошим началом). Кроме того (благодаря транскомпиляторам), ныне вы можете написать код ES6 и транскомпилировать его в код, \"совместимый с вебом\" ES5.\n\nИ наконец после публикации ES6 ее поддержка браузерами будет устойчиво расти, и в некий момент транскомпиляция больше не будет необходима для доступа широкой аудитории. Выбор спецификации ES6 был сделан редакцией обдуманно. Усовершенствования ES6 достаточно существенны, чтобы затруднить четкое и ясное изложение материала. Короче говоря, книга, которая попыталась бы рассмотреть и ES5, и ES6, навредила бы обеим темам. 3-е издание.",
    "author": "\tЭтан Браун",
    "codeISBN": "140372302",
    "published": "2017",
    "rating": "3",
    "topic": "javascript"
  },
  {
    "title": "Node.js. Разработка серверных приложений на JavaScript",
    "cover": "https://ozon-st.cdn.ngenix.net/multimedia/1014686369.jpg",
    "description": "Книга посвящена разработке веб-приложений в Node.js - платформе, которая выводит язык JavaScript за пределы браузера и позволяет использовать его в серверных приложениях. В основе платформы лежит исключительно быстрый движок JavaScript, заимствованный из браузера Chrome, к которому добавлена быстрая и надежная библиотека асинхронного сетевого ввода/вывода. Основной упор в Node.js делается на создании высокопроизводительных, хорошо масштабируемых клиентских и серверных приложений. На практических примерах вы научитесь пользоваться серверным и клиентским объектами HTTP, каркасами Connect и Express, освоите алгоритмы асинхронного выполнения и узнаете, как работать с базами данных на основе SQL и с MongoDB. Начав с практических рекомендаций по установке и настройке Node.js в режиме разработки и эксплуатации, вы научитесь разрабатывать клиентские и серверные HTTP-приложения; познакомитесь с применяемой в Node.js системой организации модулей на основе спецификации CommonJS, позволяющей реализовать подмножество технологии объектно-ориентированного проектирования. \nИздание предназначено для программистов, знакомых с основами JavaScript и веб-разработки.",
    "author": "\tДэвид Хэррон",
    "codeISBN": "136258242",
    "published": "2016",
    "rating": "4",
    "topic": "javascript"
  }
]
